In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10, 23, 33, 22, 11, 99, 76, 84, 45],
                   'var2': [100, 253, 333, 262, 111, 969, 405, 578, 760]})
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [3]:
df_num = df.iloc[:,1::]
df_num

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [4]:
df_num.transform(lambda x: x+10) # will add 10 to each value.
#df_num + 10 # same output as in above

   var1  var2
0    20   110
1    33   263
2    43   343
3    32   272
4    21   121
5   109   979
6    86   415
7    94   588
8    55   770

In [5]:
df_num.transform(lambda x: (x-x.mean())/x.std()) # normalization

       var1      var2
0 -1.040605 -1.078044
1 -0.651625 -0.560989
2 -0.352409 -0.290633
3 -0.681547 -0.530573
4 -1.010684 -1.040870
5  1.622413  1.858697
6  0.934218 -0.047312
7  1.173590  0.537332
8  0.006649  1.152392

In [6]:
#df_num.transform(lambda x: (x-x.mean())/x.std()) 
(df_num-df_num.mean())/(df_num.std()) # same output as in above

       var1      var2
0 -1.040605 -1.078044
1 -0.651625 -0.560989
2 -0.352409 -0.290633
3 -0.681547 -0.530573
4 -1.010684 -1.040870
5  1.622413  1.858697
6  0.934218 -0.047312
7  1.173590  0.537332
8  0.006649  1.152392

In [7]:
df_num.var1.transform([np.sqrt, np.exp])

       sqrt           exp
0  3.162278  2.202647e+04
1  4.795832  9.744803e+09
2  5.744563  2.146436e+14
3  4.690416  3.584913e+09
4  3.316625  5.987414e+04
5  9.949874  9.889030e+42
6  8.717798  1.014800e+33
7  9.165151  3.025077e+36
8  6.708204  3.493427e+19

In [8]:
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [9]:
df.groupby("groups")["var1"].mean()

groups
A    36.000000
B    39.333333
C    59.000000
Name: var1, dtype: float64

In [10]:
df.groupby("groups")["var1"].transform("mean")

0    36.000000
1    39.333333
2    59.000000
3    36.000000
4    39.333333
5    59.000000
6    36.000000
7    39.333333
8    59.000000
Name: var1, dtype: float64

In [15]:
df2 = pd.DataFrame({"col1":[1, 2, 3, 4],
                    "col2":[444, 555, 666, 444],
                    "col3":["abc", "xyz", "ghi", "xyz"]
                   })

In [16]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  xyz
2     3   666  ghi
3     4   444  xyz

In [17]:
def squared(x):
    return x**2

In [19]:
df2["col2"].apply(squared)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [20]:
df2["col2"].apply(np.log)

0    6.095825
1    6.318968
2    6.501290
3    6.095825
Name: col2, dtype: float64

In [21]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [23]:
df2["col3"].apply(lambda x: x[0]*3)

0    aaa
1    xxx
2    ggg
3    xxx
Name: col3, dtype: object

In [24]:
df2["col2"].apply(lambda x: "high" if x > 500 else "")

0     low
1    high
2    high
3     low
Name: col2, dtype: object

In [25]:
df3 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10, 23, 33, 22, 11, 99, 76, 84, 45],
                   'var2': [100, 253, 333, 262, 111, 969, 405, 578, 760]})
df3

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    76   405
7      B    84   578
8      C    45   760

In [27]:
df3.apply(np.sum)

groups    ABCABCABC
var1            403
var2           3771
dtype: object

In [ ]:
#df3.apply(np.sum, axis=1) # error will raise

In [28]:
df_num

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [29]:
df_num.apply(np.sum, axis=1)

0     110
1     276
2     366
3     284
4     122
5    1068
6     481
7     662
8     805
dtype: int64

In [32]:
df3.groupby("groups").apply(np.mean)

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [33]:
df3.groupby("groups").mean()

             var1        var2
groups
A       36.000000  255.666667
B       39.333333  314.000000
C       59.000000  687.333333

In [34]:
df_num

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969
6    76   405
7    84   578
8    45   760

In [37]:
df_num.applymap(lambda x: x*5)

   var1  var2
0    50   500
1   115  1265
2   165  1665
3   110  1310
4    55   555
5   495  4845
6   380  2025
7   420  2890
8   225  3800

In [38]:
df_num.apply(lambda x: x*5)

   var1  var2
0    50   500
1   115  1265
2   165  1665
3   110  1310
4    55   555
5   495  4845
6   380  2025
7   420  2890
8   225  3800

In [40]:
df_num.applymap(lambda x: x*5)

   var1  var2
0    50   500
1   115  1265
2   165  1665
3   110  1310
4    55   555
5   495  4845
6   380  2025
7   420  2890
8   225  3800

In [43]:
df_num.applymap(lambda x: len(str(x*5)))

   var1  var2
0     2     3
1     3     4
2     3     4
3     3     4
4     2     3
5     3     4
6     3     4
7     3     4
8     3     4

In [45]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  xyz
2     3   666  ghi
3     4   444  xyz

In [46]:
df2.col1.map({1:"a", 2:"b"})

0      a
1      b
2    NaN
3    NaN
Name: col1, dtype: object

In [47]:
s = pd.Series(["fox", "cow", np.nan, "dog"])
s

0    fox
1    cow
2    NaN
3    dog
dtype: object

In [49]:
s.map("I am a {}.".format)

0    I am a fox.
1    I am a cow.
2    I am a nan.
3    I am a dog.
dtype: object

In [50]:
s.map("I am a {}.".format, na_action="ignore")

0    I am a fox.
1    I am a cow.
2            NaN
3    I am a dog.
dtype: object

In [60]:
df4 = pd.DataFrame({"A":[1,2,3,4],
                   "B":[10,20,30,40]})
df4

   A   B
0  1  10
1  2  20
2  3  30
3  4  40

In [61]:
df4.apply(lambda x : x+18)

    A   B
0  19  28
1  20  38
2  21  48
3  22  58

In [62]:
df4.transform(lambda x : x+18)

    A   B
0  19  28
1  20  38
2  21  48
3  22  58

In [63]:
df4["B_ap"] = df4["B"].apply(lambda x: x+18)
df4["B_tr"] = df4["B"].transform(lambda x: x+18)

In [64]:
df4

   A   B  B_ap  B_tr
0  1  10    28    28
1  2  20    38    38
2  3  30    48    48
3  4  40    58    58

In [65]:
df4 = df4[["A", "B"]]
df4

   A   B
0  1  10
1  2  20
2  3  30
3  4  40

In [66]:
df4.transform(np.sqrt)

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226
3  2.000000  6.324555

In [67]:
df4.transform("sqrt")

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226
3  2.000000  6.324555

In [68]:
df4.apply(np.sqrt)

          A         B
0  1.000000  3.162278
1  1.414214  4.472136
2  1.732051  5.477226
3  2.000000  6.324555

In [71]:
#df4.apply("sqrt") #error will raise

In [73]:
df4.transform([np.sqrt, np.exp])

          A                    B
       sqrt        exp      sqrt           exp
0  1.000000   2.718282  3.162278  2.202647e+04
1  1.414214   7.389056  4.472136  4.851652e+08
2  1.732051  20.085537  5.477226  1.068647e+13
3  2.000000  54.598150  6.324555  2.353853e+17

In [74]:
df4.apply([np.sqrt, np.exp])

          A                    B
       sqrt        exp      sqrt           exp
0  1.000000   2.718282  3.162278  2.202647e+04
1  1.414214   7.389056  4.472136  4.851652e+08
2  1.732051  20.085537  5.477226  1.068647e+13
3  2.000000  54.598150  6.324555  2.353853e+17

In [78]:
df4.transform({"A":np.sqrt, "B":np.exp})

          A             B
0  1.000000  2.202647e+04
1  1.414214  4.851652e+08
2  1.732051  1.068647e+13
3  2.000000  2.353853e+17

In [81]:
df4.apply({"A":np.sqrt, "B":np.exp})

          A             B
0  1.000000  2.202647e+04
1  1.414214  4.851652e+08
2  1.732051  1.068647e+13
3  2.000000  2.353853e+17

In [82]:
df4.apply({"A":[np.sqrt,np.exp], "B":np.exp})

          A                        B
       sqrt        exp           exp
0  1.000000   2.718282  2.202647e+04
1  1.414214   7.389056  4.851652e+08
2  1.732051  20.085537  1.068647e+13
3  2.000000  54.598150  2.353853e+17

In [84]:
df4.apply(lambda x :  x.sum()) # != df4.transform(lambda x :  x.sum())

A     10
B    100
dtype: int64

In [85]:
df4.apply(lambda x : x["B"]- x["A"], axis=1)

0     9
1    18
2    27
3    36
dtype: int64

In [87]:
#df4.transform(lambda x : x["B"]- x["A"], axis=1) error